Repository: mozilla-l10n/mt-training-data
Catalog: ig/ig_pontoon.tmx
Source language: en_us
Languages: ig

source: We are always very happy to hear from new people who like helping on the forums so if you haven’t met our community yet <a href="%(intro_url)s"> please take a minute to introduce yourself </a>. If you want to stay low-profile, that’s also ok :). You can also find us all hanging out on IRC, on the <a href="%(irc_url)s"> #sumo channel </a>.
ig: Anyị nwere obi anụrị ịnụ n'aka ndị mmadụ ọhụrụ ndị na enyere aka n'ọgbakọ ahụ yabụ ọ bụrụ na i zutebeghi ogbe ahụ <a href="%(intro_url)s"> biko were otu nkeji iji kọwaa onwe gị</a>. Ọ bụrụ na ị chọrọ ịnọ na nzuzo, nke ahụ dị mma :). Ị nwekwara ike ịhụ ebe anyị na anọkọ na IRC, na <a href="%(irc_url)s"> channelụ #sumo </a>.

source: We are always very happy to hear from new people who like helping on the forums so if you haven’t met our community yet please take a minute to introduce yourself. If you want to stay low-profile, that’s also ok :). You can also find us all hanging out on IRC, on the #sumo channel on irc.mozilla.org.
ig: Anyị nwere obi anụrị ịnụ n'aka ndị mmadụ ọhụrụ ndị na enyere aka n'ọgbakọ ahụ yabụ ọ bụrụ na i zutebeghi ogbe ahụ biko were otu nkeji iji kọwaa onwe gị. Ọ bụrụ na ị chọrọ ịnọ na nzuzo, nke ahụ dị mma :). Ị nwekwara ike ịhụ ebe anyị na anọkọ na IRC, na channelụ #sumo na irc.mozilla.org.

source: We are having trouble reaching your email address. Please try a different address or contact an administrator.
ig: Anyị na enwe nsogbu na ịnweta adreesị email gị. Biko nwaa adreesị dị iche ma ọ bụ kpọtụrụ onye nchịkwa.

source: Web browser for Android smartphones and tablets
ig: Ihe nchọgharị weebụ maka ekwentị amamịghe na tabletị Android

source: Web browser for Windows, Mac and Linux
ig: Ihe nchọgharị weebụ maka Windows, Mac na Linux

source: Website
ig: Weebụsaịtị

source: Websites
ig: Weebụsaịtị

source: We could not activate your account. Please make sure that you have clicked the correct link in your email or typed in the correct address.
ig: Anyị enwenwughi ike ịgbalite akaụntụ gị. Biko gbaa mbọ hụ na ị pịrị njikọ ziri ezi n'ime email gị ma ọ bụ apịnyere n'adreesị ziri ezi.

source: We could not unsubscribe you from this question: <a href="%(question_url)s">%(question_title)s</a>. Please make sure you copied and pasted the unsubscribe link correctly.
ig: Anyị enwenwughi ike iwepu gị n'ajụjụ a: <a href="%(question_url)s">%(question_title)s</a>. Biko gbaa mbọ hụ na i ṅomiri ma mado njikọ nwepu aha ahụ nke ọma.

source: We couldn't find any matching tweets for %(language)s at this time. Please check again later, choose a different tweet type from the menu above, or view tweets for other languages by using the language selector at the bottom of the page.
ig: Anyị enwenwughi ike ịchọta twiit ọ bụla makọrọ maka %(language)s n'oge a. Biko lelee ọzọ ma emechaa, họrọ ụdị twiit dị iche site na menu dị n'elu, ma ọ bụ lelee twiit maka asụsụ ndị ọzọ site na iji ihe nhọpụta asụsụ n'okpuru nke ibe ahụ.

source: We couldn't find any results for <strong>{q}</strong> in <strong>{l}</strong>. Maybe one of these articles will be helpful?
ig: Anyị enwenwughi ike ịchọta nsonaazụ maka <strong>{q}</strong> na <strong>{l}</strong>. Otu n'ime edemede ndị a nwere ike ịba uru?

source: We couldn't perform your request. Perhaps because the action is no longer applicable or you tried to perform an invalid action.
ig: Anyị enwenwughi ike ịme arịrịọ gị. Enwere ike ịbụ n'ihi na ụkpụrụ ahụ adịghịzị ire ma ọ bụ ị nwara ịme ụkpụrụ na ezighi ezi.

source: Weekly meetings
ig: Nzụkọ kwa izu

source: We just wanted to let you know that %(answerer)s has found a solution to a Firefox question that you're following.
ig: Anyị naanị chọrọ ka ị mara na %(answerer)s ahụla asịsa maka ajụjụ Firefox ị na eso.

source: Welcome to SUMO!
ig: Nnọọ na SUMO!

source: We need your help!
ig: Anyị chọrọ enyemaka gị!

source: We're sorry to see you go.
ig: Anyị nwere mwute ịhụ ka ị na apụ.

source: We've just received a request to send the username linked to this email address.
ig: Anyị nwetara arịrịọ izipu aha njirimara ahụ ejikọrọ na adreesị email a.

source: We've made some educated guesses about your current browser and operating system.
ig: Anyị emeela ụfọdụ ntụnye atụlere atụle maka ihe nchọgharị na sistemụ arụmọrụ gị dị ugbu a.

source: We've sent a confirmation to %(new_email)s. Please follow the link in the confirmation to change your account's email.
ig: Anyị ezigara nkwenye na %(new_email)s. Biko soro njikọ dị na nkwenye ahụ iji gbanwee email akaụntụ gị.

source: We've sent an email to any account using this address. Please follow the link in the email to reset your password.
ig: Anyị ezigala email n'akaụntụ ọ bụla site na iji adreesị a. Biko soro njikọ ahụ dị na email ahụ iji tọgharịa okwuntughe gị.

source: We've sent an email with the username to any account using {email}.
ig: Anyị ezigala email nwere aha njirimara n'akaụntụ ọ bụla site na iji {email}.

source: We would love to find a good place for you to help users, so please send us an email with your username and the area you would like to get involved. Please feel free to add all your skills, we will try to find the right use for them :)
ig: Anyị ga-achọ ịchọta ebe mara mma maka gị iji nyere ndị ọrụ aka, yabụ biko zitere anyị email nwere aha njirimara gị yana ebe ị ga-amasị isonye. Biko ịchọkwaa itinye nka gị niile, anyị ga-anwa ịchọta ebe dị mma maka ha :)

source: What is your reply about?
ig: Gịnị ka nzaghachi gị bụ maka ya?

source: What Links Here
ig: Gịnị Na Ejikọ Ebe A

source: What Links Here | {document}
ig: Gịnị Na Ejikọ Ebe A | {document}

source: What's New
ig: Gịnị Dị Ọhụrụ

source: When German misses a level 2 change, the coverage drops to 50%, so 1% of 10%= 0.1% overall
ig: Mgbe German ghara mgbanwe ọkwa 2, mkpuchi ahụ na agbatu na 50%, yabụ 1% nke 10%=0.1% na nchịkọta

source: When the Home page article is the only localized article and it's up to date in German, then our overall coverage is 2% of 10%=0.2% overall (+ the English coverage)
ig: Mgbe edemede ibe Mbata bụ naanị edemede atụgharịrị ma zuo oke na German, mgbe ahụ mkpuchi nchịkọta anyị bụ 2% nke 10%=0.2% na nchịkọta (+ mkpuchi Bekee)

source: Where all the action happens
ig: Ebe ụkpụrụ niile na eme

source: Which category best describes your problem?
ig: Kedu otu kachasị kọwaa nsogbu gị?

source: Which product would you like to post a question about?
ig: Kedu ngwaahịa ị ga-achọ ibisa ajụjụ maka ya?

source: While you wait
ig: Ka ị na eche

source: Why should I help?
ig: Gịnị kpatara m ga-eji nyere aka?

source: Windows 8 Touch support articles
ig: Edemede nkwado Windows 8 Touch

source: Working with messages
ig: Iji ozi rụọ ọrụ

source: Would you like to view this page in %(language)s instead?
ig: Kama ị ga-achọ ịlele ibe a na %(language)s?

source: Write help articles
ig: Dee edemede enyemaka

source: X-Ray Goggles
ig: Enyo X-Ray

source: Yes, I am.
ig: Ee, abụ m.

source: Yesterday
ig: Ụnyahụ

source: You already flagged this content.
ig: Ị kapụtara ọdịnaya a.

source: You already voted on this Article.
ig: I tuliela aka na Edemede a.

source: You already voted on this reply.
ig: Ị họpụtara nzaghachi a.

source: You and 1 other replied
ig: Gị na 1 onye ọzọ zaghachiri

source: You are about to approve your own edit. Please consider asking our <a href="%(url)s">reviewers</a> instead.
ig: Ị na achọ ịkwado ndezi nke gị. Biko kama tụlee ịjụ <a href="%(url)s">ndị nyocha</a> anyị.

source: You are about to mark this revision <span class="revtime"></span> as Ready for Localization. Are you sure you wish to proceed?
ig: Ị na achọ ịkapụta ngụgharị a <span class="revtime"></span> dị ka Nkwadobe maka Ntụgharị Asụsụ. O doro gị anya na ị chọrọ ịga n'ihu?

source: You are about to permanently delete the avatar. <strong>This cannot be undone!</strong> You can always upload another avatar to replace the current one.
ig: Ị na achọ ihichapụ nghọrọ ahụ kpamkpam. <strong>Enweghị ike ịmeghasị nke a!</strong> Ị nwere ike ibugo nghọrọ ọzọ n'oge ọ bụla iji dochie nke dị ugbu a.

source: You are about to permanently delete this answer. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ig: Ị na achọ hichapụ azịza a kpamkpam. <strong>Enweghị ike ịmeghasị nke a!</strong> O doro gị anya na ị chọrọ ịga n'ihu?

source: You are about to permanently delete this document. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ig: Ị na achọ hichapụ dọkụmentị a kpamkpam. <strong>Enweghị ike ịmeghasị nke a!</strong> O doro gị anya na ị chọrọ ịga n'ihu?

source: You are about to permanently delete this image. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ig: Ị na achọ hichapụ onyonyo a kpamkpam. <strong>Enweghị ike ịmeghasị nke a!</strong> O doro gị anya na ị chọrọ ịga n'ihu?

source: You are about to permanently delete this post. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ig: Ị na achọ ihichapụ mbisa a kpamkpam. <strong>Enweghị ike ịmeghasị nke a!</strong> O doro gị anya na ị chọrọ ịga n'ihu?

source: You are about to permanently delete this question. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ig: Ị na achọ ihichapụ ajụjụ a kpamkpam. <strong>Enweghị ike ịmeghasị nke a!</strong> O doro gị anya na ị chọrọ ịga n'ihu?

source: You are about to permanently delete this revision. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ig: Ị na achọ hichapụ ngụgharị a kpamkpam. <strong>Enweghị ike ịmeghasị nke a!</strong> O doro gị anya na ị chọrọ ịga n'ihu?

source: You are about to permanently delete this thread. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ig: Ị na achọ ihichapụ usoro a kpamkpam. <strong>Enweghị ike ịmeghasị nke a!</strong> O doro gị anya na ị chọrọ ịga n'ihu?

source: You are about to permanently delete this video. <strong>This cannot be undone!</strong> Are you sure you want to continue?
ig: Ị na achọ hichapụ vidio a kpamkpam. <strong>Enweghị ike ịmeghasị nke a!</strong> O doro gị anya na ị chọrọ ịga n'ihu?

source: You are about to permanently delete your avatar. <strong>This cannot be undone!</strong> You can always <a href="%(upload_url)s">upload another avatar</a> to replace your current one.
ig: Ị na-achọ ihichapụ nghọrọ gị kpamkpam. <strong>Enweghị ike ịmeghasị nke a!</strong> Ị nwere ike oge niile <a href="%(upload_url)s">bugoo nghọrọ ọzọ</a> iji dochie nke dị ugbu a.

source: You are about to subscribe to:
ig: Ị na achọ ịdebanye aha na:

source: You are not currently watching anything.
ig: Ị naghị elele ihe ọ bụla ugbu a.

source: You are not logged in.
ig: Ị banyeghị.

source: You are not watching this thread
ig: Ị naghị elele usoro a

source: You are now part of the Contributors group!
ig: Ugbu a bụ akụkụ nke otu Ndị Nkwado!

source: You are translating an English document which is not yet ready for localization.
ig: Ị na atụgharị asụsụ dọkụmentị Bekee nke na adịbeghị njikere maka ntụgharị asụsụ.

source: You are watching this thread
ig: Ị na elele usoro a

source: You can also apply to our Buddy Program and get guidance from our more experienced contributors. Just introduce yourself in the forum for New Contributors by starting a new thread. Put your name on the thread title and tell us a bit about yourself:
ig: Ị nwekwara ike itinye akwụkwọ na Mmemme Enyi anyị ma nweta nduzi site n'aka ndị nkwado anyị ka nwee ahụmịhe. Naanị kọwaa onwe gị n'ọgbakọ ahụ maka Ndị Nkwado Ọhụrụ site na ibido usoro ọhụrụ. Tinye aha gị n'aha usoro ahụ ma gwa anyị obere ihe gbasara gị:

source: You can log in at:
ig: Ị nwere ike ịbanye na:

source: You cannot translate this document.
ig: Ị nweghị ike ịtụgharị asụsụ dọkụmentị a.

source: You can now log in.
ig: Ugbu a ị nwere ike ịbanye.

source: You can view the solution using the link below.
ig: Ị nwere ike ịlele azịza ahụ site na iji njikọ dị n'okpuru.

source: You do not have permission to access this page.
ig: Ị nweghị ikikere iji nweta ibe a.

source: You do not have permission to do that.
ig: Ị nweghị ikikere iji mee nke ahụ.

source: You don't need to register to <a href="{url}">ask a question</a>.
ig: Ị gaghị edebanyerịrị aha iji <a href="{url}">jụọ ajụjụ</a>.

source: You have been automatically logged in.
ig: Etinyere gị na akpaghị aka.

source: You have been awarded the <strong>%(title)s</strong> badge!
ig: Enyela gị akara <strong>%(title)s</strong>!

source: You have been awarded the %(title)s badge!
ig: Enyela gị otito akara %(title)s!

source: You have been unsubscribed.
ig: Ewepula gị.

source: You have exceeded the number of private messages that can be sent in a day.
ig: Ị gafeela ọnụọgụ nke ozi nzuzo enwere ike izipu n'otu ụbọchị.

source: You have exceeded the number of threads and replies that can be posted in a given amount of time. Please try again shortly.
ig: Ị gafeela ọnụọgụ usoro na nzaghachi kachasị enwere ike ibisa na nwa obere oge. Biko nwaa ọzọ n'oge adịghị anya.

source: You have flagged this content. A moderator will review your submission shortly.
ig: Ị kapụtara ọdịnaya a. Onye nduzi ga-enyocha nnyefe gị n'obere oge.

source: You have not selected an image to upload.
ig: Ị họpụtabeghị onyonyo ibugo.

source: You have successfully changed your password.
ig: Ị gbanwere okwuntughe gị na enweghị nsogbu.

source: You have successfully changed your password. <a href="%(profile_url)s">Go back to edit profile page.</a>
ig: Ị gbanweela okwuntughe gị na enweghị nsogbu. <a href="%(profile_url)s">Laghachi na dezie ibe profaịlụ.</a>

source: You may log in at https://{domain}{login_url}
ig: Ị nwere ike ịbanye na https://{domain}{login_url}

source: You might just make someone's day!
ig: Ị nwere ike ịmere mmadụ ezigbo ihe!

source: You must <a href="{login_url}">log in to your account</a> to reply to posts. Please <a href="{ask_url}">start a new question</a>, if you do not have an account yet.
ig: Ị ga-abanyerịrị <a href="{login_url}">n'akaụntụ gị</a> iji zaghachi mbisa. Biko <a href="{ask_url}">bido otu ajụjụ ọhụrụ</a>, ọ bụrụ na ị nwebeghị akaụntụ.

source: You must have cookies enabled to login or register.
ig: Ị ga-enwerịrị kuki agbanyere iji banye ma ọ bụ debanye aha.

source: Your account is already activated, log in below.
ig: Agbalitela akaụntụ gị, banye ugbu a.

source: Your account is successfully verified, and your question is now posted on the Mozilla community support forum.
ig: Enyochara akaụntụ gị na enweghị nsogbu, ebisara ajụjụ gị ugbu a na ọgbakọ nkwado ogbe Mozilla.

source: Your account was sucessfully closed!
ig: Emechiri akaụntụ gị na enweghị nsogbu!

source: Your avatar will be resized to {size}x{size}
ig: A ga-ahazigharị nha nke nghọrọ gị ka ọ bụrụ {size}x{size}

source: Your email has been changed from {old_email} to {new_email}.
ig: Agbanweela email gị site na {old_email} ka ọ bụrụ {new_email}.

source: You replied
ig: Ị zaghachiri

source: Your issue has been submitted successfully. You should receive a confirmation email and hear back from us shortly.
ig: Enyefere nsogbu gị na enweghị nsogbu. Ị ga-enweta email nkwenye ma nụ ozi anyị n'obere oge.

source: Your message was sent!
ig: Ezipuru ozi gị!

source: You rock! We'll send an email to let you know if your changes get approved. You can follow the discussion about this article by clicking the Discussion tab.
ig: Ị bụ odogwu! Anyị ga-ezite email iji mee ka ị mara ma ọ bụrụ na akwado mgbanwe gị. Ị nwere ike iso mkparịta ụka maka edemede a site na ịpị taabụ Mkparịta ụka.

source: Your password was successfully reset.
ig: Atọgharịrị okwuntughe gị na enweghị nsogbu.

source: Your revision has been approved: {title}
ig: Akwadola ngụgharị gị: {title}

source: Your revision has been reviewed.
ig: Enyochaala ngụgharị gị.

source: Your revision has been reviewed: {title}
ig: Enyochaala ngụgharị gị: {title}

source: Your settings have been saved.
ig: Echekwaala ntọala gị.

source: Your title is too short (%(show_value)s characters). It must be at least %(limit_value)s characters.
ig: Aha gị dị oke mkpụmkpụ (mkpụrụedemede %(show_value)s). Ọ ga-abụrịrị opekata mpe mkpụrụedemede %(limit_value)s.

source: Your username is:
ig: Aha njirimara gị bụ:

source: Your username on %s
ig: Aha njirimara gị na %s

source: Your username will be shown next to your question in our public support forums.
ig: A ga-egosi aha njirimara gị n'akụkụ ajụjụ gị n'ọgbakọ nkwado ọhaneze anyị.

source: Your Web browser doesn't appear to have cookies enabled. Cookies are required for logging in.
ig: Ihe nchọgharị Weebụ gị anaghị egosi na agbanyere kuki. Achọrọ kuki maka nbanye.

source: You should receive an email shortly to confirm your subscription.
ig: Ị kwesịrị ịnweta email n'obere oge iji kwenye na ndebanye gị.

source: You've confirmed your email address and activated your account! You can now log in, and go edit your profile.
ig: Ị kwenyela na adreesị email gị ma gbalite akaụntụ gị! Ugbu a ị nwere ike ịbanye, ma gaa dezie profaịlụ gị.

source: You were awarded the '{title}' badge!
ig: Enyere gị nrite akara '{title}'!

source: You will always control every tweet you post.
ig: Ị ga-ejikwa twiit ọ bụla i bisara.

source: You will be notified of updates by email.
ig: A ga-ezitere gị ozi maka mmelite site na email.

source: You will be unsubscribed from: <br><strong>%(object)s</strong>
ig: A ga-ewepu aha gị na: <br><strong>%(object)s</strong>

source: You will need to confirm the newly set email address to complete the change.
ig: Ị ga-ekwenye na adreesị email atọrọ ọhụrụ iji mezuo mgbanwe ahụ.

source: You will now receive updates via email.
ig: Ugbu a ị ga-enweta mmelite site na email.

source: abnormality
ig: ihe nwere ike ịbụ ntụpọ

source: account recovery key
ig: ọtụgwọ nweghachite akaụntụ

source: add-on
ig: mgbakwụnye

source: aggregate
ig: nke akpọkọtara

source: All Hands
ig: Aka Niile

source: alternate text
ig: ngwe mpụrụnnọchite

source: appear
ig: gosi

source: appearance
ig: ngosipụta

source: attack
ig: wakpo

source: attacker
ig: ọnye mwakpo

source: Attack Site
ig: Ajọ Saịtị

source: attendee
ig: onye na-abịa

source: authenticate
ig: nyochaa

source: authenticated
ig: enyochago

source: autoplay
ig: mkpọnàònwe

source: back out
ig: laghachị azụ

source: backup authentication code
ig: koodu nkwadoeziokwu nke nkwàlite

source: black box
ig: gbanyụọ ebenkwụsịtụ

source: bookmark
ig: ebenrụtụakā

source: boolean
ig: bulian

source: boot
ig: wepu

source: breakpoint
ig: ebenkwụsịtụ

source: Bug report
ig: Ozi mperi

source: certificate authority
ig: asambodo nnwetaikikere

source: channel
ig: ọwa

source: cipher
ig: saịfa

source: clipboard
ig: ebendobeàmà

source: clockwise
ig: ka elekere

source: colorway
ig: agba dị iche iche

source: compact
ig: mpịkọta

source: compact - recommend deprioritize
ig: pịkọta - na-enye ndụmọdụ ka ị wepu ọkacha mkpà

source: context
ig: ọnọdụ

source: contribute
ig: tinye aka

source: corrupt
ig: mebiri emebi

source: corrupted
ig: mebiri emebi

source: counterclockwise
ig: ka nlaghàchiazụelekere

source: cryptominer
ig: onye ngwuputa krịpto

source: cryptomining
ig: ngwuputa krịpto

source: debug
ig: wepụ mmejọ

source: deceptive site
ig: ajọ saịtị

source: decode
ig: dikoodu

source: decryption
ig: ntụghèpụ èdenzuzo

source: disinformation
ig: ozi nke abụghị eziokwu

source: distrust
ig: enweghị ntụkwasị obi

source: eavesdropping
ig: ekweghị ịnye ikike

source: enable
ig: mee ka e nwee ike

source: encode
ig: tinye koodu

source: encrypt
ig: zonye ederede

source: encryption
ig: nzonye ederede

source: end user
ig: ojiarụ

source: Enhanced Tracking Protection
ig: Nchedo Nsochi Emezilitere

source: executable file
ig: faịlụ ntinyenọrụ

source: extension
ig: mgbatị

source: external
ig: nke ezi

source: Fellow
ig: Ibe

source: filter bubble
ig: afụrụafụmyọ

source: fingerprinter
ig: ihe nsochi ọpụrụiche

source: fingerprinting
ig: nsochi ọpụrụiche

source: Firefox View
ig: Nlele Faịyafọksị

source: gear
ig: ihe anyị na-ere

source: grassroots
ig: nke ọha

source: home page
ig: ihuakwụkwọ mbụ

source: idle
ig: nkịtị

source: import
ig: tụbata

source: innovations
ig: njirimara ọhụrụ

source: insecure
ig: enweghị nchedo

source: installation
ig: nkwakọnye

source: Issue
ig: Bupute

source: Legacy extension
ig: Mgbatị ekpe

source: misinformation
ig: ozu nke abụghị eziokwu

source: native
ig: ọdịnala

source: open source
ig: mepee nsipụta

source: override
ig: nọchie

source: participation
ig: nsonye

source: Patch
ig: Mmado

source: pop-up
ig: ndolielu

source: preference
ig: mmasị

source: release
ig: mbupute

source: report
ig: mkpesa

source: revert
ig: tụgharịa

source: search suggestion
ig: ntụnye ọchịchọ

source: security keys
ig: ọtụgwo nchedo

source: sensitive
ig: dị oke mkpa

source: sidebar
ig: ogwèakụkụ

source: sign
ig: banye

source: signer
ig: onyembiaka

source: studies
ig: ọmụmụ

source: track
ig: sochie

source: trackers
ig: ihe nsochi

source: Tracking Content
ig: Ihe Eji Esochi

source: Turbo Mode
ig: Ọnọdụ Ọsọ

source: unencrypted
ig: enweghị nzonye

source: unresponsive
ig: na-adịghị eme ụṅara

source: unsafe
ig: enweghị nchekwa

source: validate
ig: kwàdo

source: validity
ig: adịmiire

source: version
ig: àgbà

source: Web Authentication
ig: Nkwadoeziokwu Weebụ

source: Copied!
ig: edepụtachaghiri

source: Copy link
ig: Detuo njikọ

source: Copy the link to share your file:
ig: Detuo njikọ ahụ iji kee faịlụ gị

source: Decrypting…
ig: Kpebie

source: Download complete
ig: Mbudata zuru ezu

source: Download files
ig: Budata faịlụ gasi

source: Download { -firefox }
ig: Budata

source: Encrypting…
ig: ezoro ezo...

source: Expires after { $downloadCount } or { $timespan }
ig: Ọ ga-agwu mgbe { $downloadCount } ma ọ bụ { $timespan } gasịrị

source: Firefox Send
ig: Firefox Zipu

source: Firefox Send requires JavaScript
ig: Firefox Zipu chọrọ

source: Importing…
ig: Mbubata…

source: Incorrect password. Try again.
ig: okwuntughe ezighi ezi.Nwaa ọzọ

source: Legal
ig: n'Iwu

source: Link expired
ig: Njiko jedebe

source: Maximum password length: { $length }
ig: Oke okwuntughe kachasị: { $length }

source: { $num } days
ig: ụbọchị { $num }

source: { $num } downloads
ig: Abuọ

source: { $num } hours
ig: { $num } abụọ

source: { $num } weeks
ig: izu { $num }

source: ({ $partialSize } of { $totalSize })
ig: ({ $partialSize } nke { $totalSize })

source: Please enable JavaScript and try again.
ig: Biko họrọ JavaScript ma nwaa ọzọ

source: { -send-brand } lets you share files with end-to-end encryption and a link that automatically expires. So you can keep what you share private and make sure your stuff doesn’t stay online forever.
ig: na-ahapu gị ịkekọrịta faịlụ na izo ya na njedebe na njedebe na-akwụsị na akpaghị aka. Yabụ ị nwere ike idobe ihe ị na -eche ma hụ na ngwongwo gị agaghị adị n'ịntanetị ruo mgbe ebighi ebi.

source: { -send-brand } will not work with this browser. { -send-short-brand } works best with the latest version of { -firefox }, and will work with the current version of most browsers.
ig: agaghị eji ihe nchọgharị a rụọ ọrụ. na arụ ọrụ kacha mma na ụdị nke , ọ ga-arụkwa ụdị nke ihe nchọgharị ka ugbu a.

source: { -send-short-brand } Privacy Notice
ig: Nkwupụta Nzuzo

source: Simple, private file sharing
ig: Mfe, nkekọrịta faịlụ nkeonwe

source: Something went wrong!
ig: Onwere ihe na-adighi mma

source: That file is too big to upload. It should be less than { $size }
ig: Failu a ebuka ibulite. Ọ kwẹsịghi ịkalị { $size }

source: This file was shared via { -send-brand } with end-to-end encryption and a link that automatically expires.
ig: Nkekọrịta faịlụ a site na site na iji zoo njedebe na-njedebe yana otu njikọ na-akwụsị na-akpaghị aka.

source: This link has expired.
ig: Njikọ a emebiela.

source: This password could not be set
ig: Enweghị ike ịtọ paswọọdụ a

source: Total size: { $size }
ig: { $nha }

source: Try Firefox Send
ig: Firefox Zipu

source: Try { -send-brand } for simple, safe file sharing.
ig: Gbalịa maka nyefe faịlụ dị mfe.
